In [33]:
-- Data overview
SELECT *
FROM baby_names
LIMIT 5;

   year first_name sex    num
0  1920       Mary   F  70982
1  1920    Dorothy   F  36643
2  1920      Helen   F  35097
3  1920   Margaret   F  27994
4  1920       Ruth   F  26101

In [34]:
-- List of the overall top five names in alphabetical order. Which one is "Classic" or "Trendy" ?

SELECT 
	first_name, 
	SUM(num),
	CASE WHEN COUNT(*) > 50 THEN 'classic'
    ELSE 'trendy'
  END AS popularity_type
FROM baby_names
GROUP BY first_name
ORDER BY first_name
LIMIT 5;

  first_name     sum popularity_type
0    Aaliyah   15870          trendy
1      Aaron  530592         classic
2    Abigail  338485          trendy
3       Adam  497293          trendy
4    Addison  107433          trendy

In [35]:
-- The top 20 male names overall; how did the name Paul rank?

SELECT 
	RANK() OVER(ORDER BY SUM(num) DESC) AS name_rank,
	first_name,
	SUM(num) AS sum
FROM baby_names
WHERE sex = 'M'
GROUP BY first_name
LIMIT 20;

-- Paul is ranked 17th

    name_rank   first_name      sum
0           1        James  4748138
1           2         John  4510721
2           3       Robert  4495199
3           4      Michael  4278824
4           5      William  3614424
5           6        David  3571498
6           7      Richard  2414838
7           8       Joseph  2361382
8           9       Thomas  2166802
9          10      Charles  2112352
10         11  Christopher  2012792
11         12       Daniel  1824274
12         13      Matthew  1567204
13         14      Anthony  1344352
14         15       Donald  1280236
15         16         Mark  1265910
16         17         Paul  1218996
17         18       Steven  1216819
18         19       Joshua  1204236
19         20       Andrew  1157548

In [36]:
-- Which female names appeared in both 1920 and 2020?

SELECT 
	first_name,
	SUM(num) AS total_occurrences
FROM baby_names
WHERE sex = 'F' AND year IN (1920, 2020)
GROUP BY first_name
HAVING COUNT(DISTINCT year) = 2;

  first_name  total_occurrences
0    Eleanor              14832
1  Elizabeth              23125
2       Emma              20818
3     Evelyn              23283
4      Grace              12741
5      Hazel              12765